void main(){
// // for loop:-----------------
// // for ( start ; end ; looping){
// //الكود اللى هيتكرر
// //}

// for (int i = 2000 ; i<=2025 ; i++){
//   print(i);
// }

// // While loop:----------
// int c =2000;
// while(c<=2025){
//   print(c);
//   c++;
// }

// //do While loop:----------
// // بتنفذ الكود وبعدين يتتحقق يعنى بتتنفذ على الاقل مره واحده حتى لو الشرط غير محقق
// int v =2025;
// do{
//   print(v);
// }while(v!=2025);

// // the same from while and for
// int b =2000;
// do{
//   print(b);
//   b++;
// }while(b<=2025);

//_____________________________________________________________________________________________
// break and continue:----

// for (int i =1 ; i<=10 ; i++){
//   if (i ==5){
//     print("nada");
//     break;  // بتخرج
// //   }
//   print(i);
// }

// for (int i =1 ; i<=10 ; i++){
//   if (i ==5){
//     print("nada");
//     continue;   //  بتروح للحاله اللي بعدها وبتتجاهل ما بعد هذا السطر يعني الكود بعدها غير مقروء
//   }
//   print(i);
// }


}